Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.gce.google_compute_instance.default will be updated in-place
~ resource "google_compute_instance" "default" {
        id                   = "projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis"
      ~ metadata             = {
          - "ssh-keys" = <<-EOT
                goboolean241225:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBDpUHo1SU1tRiOM8JPKs0RoUFHWzF+DHFdJRfsJamX7vRh7nYZJC+SvlprV9X+tg5/6PZ9hxVim8nBpdHQYU7ZI= google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-01-27T03:03:11+0000"}
                goboolean241225:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAHpphwGGVGm6g4/dRu7r8Y1X+metST+E4ffoLdMmg6kDYJqsf4d2P1YIbcIFjkEW7nbdE7u4coJ38jRGwI0zgr/3tTz2PNxYxdz0hyVrs0Qxx2hHiYegsuV6Vs/cD2kjxNjqVPSu1tP89bRBoQcdPwMuHGmc+LjYUoh809Bwpm55fVFdbzrrekaDP/dvNc/QsBBF5oa+Xo6IRAIatWo9GpI0u9cMCsjn/lVjprfHQj1xccLgibM1LoHUpg4bY692PCkHmBPH/g/gHgLm5p/4bgcuJcpVBXQnOWI0T9e8UCEMVTyUBak3HuAIm1/T1BGNgTik9l4O2yD1LRyOSVjGuUs= google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-01-27T03:03:19+0000"}
            EOT -> null
        }
        name                 = "atlantis"
        tags                 = [
            "atlantis-server",
        ]
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.primary_nodes will be updated in-place
~ resource "google_container_node_pool" "primary_nodes" {
        id                          = "projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke/nodePools/goboolean-448812-gke"
        name                        = "goboolean-448812-gke"
        # (10 unchanged attributes hidden)

      ~ node_config {
            tags              = [
                "gke-node",
                "goboolean-448812-gke",
            ]
            # (18 unchanged attributes hidden)

          - kubelet_config {
              - cpu_cfs_quota        = false -> null
              - pod_pids_limit       = 0 -> null
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.istio.helm_release.istio_base will be created
+ resource "helm_release" "istio_base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.24.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.istio.helm_release.istio_ingressgateway will be created
+ resource "helm_release" "istio_ingressgateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-ingressgateway"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.24.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.istio.helm_release.istiod will be created
+ resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istiod"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.24.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 2 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
